<?php
/**
 * @note:定义验证--错误类事件
 * @return ${TYPE_HINT}
 * @author:Je_taime
 * @time: 2022/3/24 9:09
 */

namespace App\Exceptions\Lang;
class Warning
{
    public static function Code($code)
    {
        $maps = static::Msg();
        return $maps[$code] ?? '验证失败';
    }

    public static function Msg()
    {
        return [
            '60002' => '缺少参数',
            '60003' => '参数错误',
            '60004' => '已达上限',
            '60005' => '暂无数据',


            '61001' => '图片文件不存在',
            '61002' => '请上传正确的图片文件',
            '61003' => '图片大小限制10M',
            '61004' => '安装包文件不存在',
            '61005' => '文件大小超过100M',
            '61006' => '短信发送-触发分钟级流控',
            '61007' => '短信发送-触发小时级流控',
            '61008' => '短信发送-触发自然日级流控',
            '61009' => '短信发送-触发IP流控',
            '61010' => '短信发送--参数错误',
            '61011' => '短信发送--参数错误(B)',
            '61012' => '验证码--验证失败',
            '61013' => '身份证号码--校检错误',

            '62001' => '正在充值,稍后重试',
            '62002' => '已充值,请刷新',
            '62003' => '充值卡,不存在',

            '65001' => '账号/密码--错误',
            '65002' => '授权令牌--错误',
            '65003' => '账号冻结--错误',
            '65004' => '暂无权限',
            '65005' => '账号已注册--请登录',
            '65006' => '账号其他设备--登录',
            '67777' => '更新中....',
            '68888' => '刷新-重试',
            '68889' => '数据解析--失败',
            '69998' => '网络错误',
            '69999' => '连接超时--请重试'
        ];
    }
}
